Revit 2027 API
UnitTypeId.NewtonsPerMeter Property
 Newtons per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NewtonsPerMeter { get; }
Public Shared ReadOnly Property NewtonsPerMeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NewtonsPerMeter {
	ForgeTypeId^ get ();
}
static member NewtonsPerMeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace